test/goldens/graph-to-dot/graph_test_11.dot
digraph unix {
  graph [ dpi = 72 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Arial"
  node [fontname="Arial"]
  edge [fontname="Arial"]
  subgraph cluster_root_200 {
    label = "root"; // scope
    invisible0 [label = "", shape = point, style=invis]; // root
    subgraph cluster_butterFly_202 {
      label = "butterFly"; // scope
      invisible1 [label = "", shape = point, style=invis]; // butterFly
      subgraph cluster_level3_204 {
        label = "level3"; // scope
        s111_198 [
          label = "s111"; // node
        ];
        c111_212 [
          label = "c111"; // node
        ];
        subgraph cluster_level2_206 {
          label = "level2"; // scope
          s11_199 [
            label = "s11"; // node
          ];
          s10_200 [
            label = "s10"; // node
          ];
          s01_201 [
            label = "s01"; // node
          ];
          s00_202 [
            label = "s00"; // node
          ];
          c00_208 [
            label = "c00"; // node
          ];
          c01_209 [
            label = "c01"; // node
          ];
          c10_210 [
            label = "c10"; // node
          ];
          c11_211 [
            label = "c11"; // node
          ];
          subgraph cluster_level1_208 {
            label = "level1"; // scope
            s1_203 [
              label = "s1"; // node
            ];
            s0_204 [
              label = "s0"; // node
            ];
            c0_206 [
              label = "c0"; // node
            ];
            c1_207 [
              label = "c1"; // node
            ];
            subgraph cluster_level0_210 {
              label = "level0"; // scope
              x_205 [
                label = "x"; // node
              ];
              
            }
            
          }
          
        }
        
      }
      
    }
    
  }
  "s111_198" -> "s11_199";
  "s11_199" -> "s1_203";
  "s10_200" -> "s1_203";
  "s01_201" -> "s0_204";
  "s00_202" -> "s0_204";
  "c11_211" -> "c111_212";
  "s1_203" -> "x_205";
  "s0_204" -> "x_205";
  "c0_206" -> "c00_208";
  "c0_206" -> "c01_209";
  "c1_207" -> "c10_210";
  "c1_207" -> "c11_211";
  "x_205" -> "c0_206";
  "x_205" -> "c1_207";
}
